In [80]:
import numpy as np
import pandas as pd

In [81]:
np.random.seed(101)

### Creating DataFrames:

In [82]:
df=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [83]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Indexing :

#### Get the columns:

In [84]:
# get the datas from W column .
# It actually returns a series of datas with the labels. So DataFrames are nothing but collection of series


df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [85]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [33]:
#get multiple columns
# pass the list of columns as a argument

df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [34]:
df[['W','Y','X']]

          W         Y         X
A  2.706850  0.907969  0.628133
B  0.651118 -0.848077 -0.319318
C -2.018168  0.528813  0.740122
D  0.188695 -0.933237 -0.758872
E  0.190794  2.605967  1.978757

#### Create a new column :

In [37]:


df['X+Y']=df['X']+df['Y']

In [38]:
df

          W         X         Y         Z       X+Y
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [50]:
#get a new column with random values

df['NEW']=np.random.randn(5)

In [51]:
df

          W         X         Y         Z       X+Y       NEW
A  2.706850  0.628133  0.907969  0.503826  1.536102 -0.633348
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395 -0.487281
C -2.018168  0.740122  0.528813 -0.589001  1.268936 -1.647469
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109  0.543758
E  0.190794  1.978757  2.605967  0.683509  4.584725 -1.210949

#### Delete the columns:

In [53]:
# It takes the list of columns which are to be deleted as an argument
df.drop(['X+Y','NEW'],axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df

          W         X         Y         Z       X+Y       NEW
A  2.706850  0.628133  0.907969  0.503826  1.536102 -0.633348
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395 -0.487281
C -2.018168  0.740122  0.528813 -0.589001  1.268936 -1.647469
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109  0.543758
E  0.190794  1.978757  2.605967  0.683509  4.584725 -1.210949

In [56]:
# Delete permanently:
# Inplace will be true

df.drop(['X+Y','NEW'],1,inplace=True)

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Drop the row:

In [58]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [60]:
df.shape

(5, 4)

#### Get the rows :

In [65]:
#using loc

df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [66]:
# get rows A and B

df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [72]:
# using iloc
print(df)
print()
df.iloc[0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [73]:
df.iloc[[0,1,2]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

### Grab specific rows and columns :

In [75]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [74]:
#grab an element

df.loc['A','W']

2.706849839399938

In [77]:
#grab subset

df.loc[['A','C','D'],['W','X']]

          W         X
A  2.706850  0.628133
C -2.018168  0.740122
D  0.188695 -0.758872

In [78]:
df.loc[['A','B'],['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965

In [79]:
df.loc['C':,'Y':]

          Y         Z
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509